# В начале указываем на базе какого образа этот
FROM python:3.11-alpine

#Подгатавливаем каталог с коталогом приожения
#как рабочий каталог
WORKDIR /app

#Копируем текущее приложение
#Конкретно копируем именно папку django_project
#Точка в конце обозначает текущий каталог в Docker Образе
COPY ./django_project .
COPY ./manage.py .

#Помимо прилозения нам понадобится файлик
COPY ./requirements.txt .

#Можно прописать команду RUN
RUN pip install -r requirements.txt


# CMD и ENTRYPOINT несильно отличаются
#Указываем просто команду как в обычном терминале, но не как строчку с пробелами
#Строки будут собраны через пробел в команду
#runserver в конце - не достаточно
CMD ["python", "manage.py", "runserver"]










